Revit 2026 API

# ViewSetFilterOverrides Method

---

Sets the overrides associated with a filter.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void SetFilterOverrides(
	ElementId filterElementId,
	OverrideGraphicSettings overrideGraphicSettings
)
```
```vb
Public Sub SetFilterOverrides (
	filterElementId As ElementId,
	overrideGraphicSettings As OverrideGraphicSettings
)
```
```cpp
public:
void SetFilterOverrides(
	ElementId^ filterElementId,
	OverrideGraphicSettings^ overrideGraphicSettings
)
```
```fsharp
member SetFilterOverrides :
        filterElementId : ElementId *
        overrideGraphicSettings : OverrideGraphicSettings -> unit
```

#### Parameters

filterElementId ElementId
     ElementId of the filter.
overrideGraphicSettings OverrideGraphicSettings
     The overrides to apply to the filter.

| Exception | Condition |
| --- | --- |
| ArgumentException | ElementId is not associated with a FilterElement. -or- Fill pattern must be a drafting pattern. -or- Fill pattern Id must be invalidElementId or point to a LinePattern element. |
| ArgumentNullException | A non-optional argument was null |
| InvalidOperationException | The element "this View" does not belong to a project document. -or- The view type does not support Visibility/Graphics Overriddes. |

If the filter is not currently applied to the view, this will add the filter with the assigned overrides.

#### Reference

View Class

Autodesk.Revit.DB Namespace